PLAN FOR: deployments/pulse3d/terraform <br /> module.pulse3d.aws_s3_bucket.pulse3d_uploads_bucket: Refreshing state... [id=modl-pulse3d-uploads]
module.pulse3d.aws_ecr_repository.pulse3d_ecr_repo: Refreshing state... [id=pulse3d_api]
module.pulse3d.aws_ecr_lifecycle_policy.pulse3d_ecr_lifecycle_policy: Refreshing state... [id=pulse3d_api]
module.pulse3d.aws_s3_bucket_cors_configuration.pulse3d_uploads_bucket: Refreshing state... [id=modl-pulse3d-uploads]
module.pulse3d.aws_s3_bucket_policy.pulse3d_uploads_bucket: Refreshing state... [id=modl-pulse3d-uploads]
module.pulse3d.aws_s3_bucket_ownership_controls.pulse3d_uploads_bucket: Refreshing state... [id=modl-pulse3d-uploads]
module.pulse3d.aws_s3_bucket_server_side_encryption_configuration.pulse3d_uploads_bucket: Refreshing state... [id=modl-pulse3d-uploads]
module.pulse3d.aws_s3_bucket_acl.pulse3d_uploads_bucket: Refreshing state... [id=modl-pulse3d-uploads,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.pulse3d.aws_s3_bucket.private_downloads_bucket will be created
  + resource "aws_s3_bucket" "private_downloads_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "curi-modl-private-downloads"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.pulse3d.aws_s3_bucket_acl.private_downloads_bucket will be created
  + resource "aws_s3_bucket_acl" "private_downloads_bucket" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.pulse3d.aws_s3_bucket_cors_configuration.private_downloads_bucket will be created
  + resource "aws_s3_bucket_cors_configuration" "private_downloads_bucket" {
      + bucket = "curi-modl-private-downloads"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
            ]
          + allowed_origins = [
              + "https://dashboard.curibio-modl.com",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 0
        }
    }

  # module.pulse3d.aws_s3_bucket_cors_configuration.pulse3d_uploads_bucket will be updated in-place
  ~ resource "aws_s3_bucket_cors_configuration" "pulse3d_uploads_bucket" {
        id     = "modl-pulse3d-uploads"
        # (1 unchanged attribute hidden)

      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "GET",
              - "POST",
            ] -> null
          - allowed_origins = [
              - "http://localhost:3000",
              - "https://dashboard.curibio-modl.com",
              - "https://dashboard.curibio-test.com",
            ] -> null
          - expose_headers  = [] -> null
          - max_age_seconds = 0 -> null
        }
      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://dashboard.curibio-modl.com",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 0
        }
    }

  # module.pulse3d.aws_s3_bucket_ownership_controls.private_downloads_bucket will be created
  + resource "aws_s3_bucket_ownership_controls" "private_downloads_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.pulse3d.aws_s3_bucket_policy.private_downloads_bucket will be created
  + resource "aws_s3_bucket_policy" "private_downloads_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.pulse3d.aws_s3_bucket_server_side_encryption_configuration.private_downloads_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "private_downloads_bucket" {
      + bucket = "curi-modl-private-downloads"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.